import json

import requests
import time
from util.util import gen_headers

"""
    {
        "北京_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
"""
query_params = [
    {
        "北京_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "北京_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "北京_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "北京_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "天津_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河北_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河北_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河北_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "河北_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河北_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河北_2017_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山西_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山西_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山西_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山西_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山西_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山西_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "内蒙古_2020_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2020_文史_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "内蒙古_2019_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2019_文史_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "内蒙古_2018_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2018_文史_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "内蒙古_2017_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2017_文史_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "内蒙古_2017_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2020_理工_sex_campus": [
            "普通类",
            "中俄合作办学"
        ]
    },
    {
        "辽宁_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "辽宁_2020_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2020_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2019_理工_sex_campus": [
            "普通类",
            "中俄合作办学"
        ]
    },
    {
        "辽宁_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "辽宁_2019_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2019_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2018_理工_sex_campus": [
            "普通类",
            "中俄合作办学"
        ]
    },
    {
        "辽宁_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "辽宁_2018_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2017_理工_sex_campus": [
            "普通类",
            "中俄合作办学"
        ]
    },
    {
        "辽宁_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "辽宁_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "辽宁_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "吉林_2020_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "吉林_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "吉林_2019_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "吉林_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "吉林_2018_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "吉林_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "吉林_2017_理工_sex_campus": [
            "普通类",
            "蒙授"
        ]
    },
    {
        "吉林_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "黑龙江_2020_理工_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2020_文史_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2020_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2020_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2019_理工_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2019_文史_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2019_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2019_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2018_理工_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2018_文史_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "中美121项目",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2018_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2017_理工_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2017_文史_sex_campus": [
            "普通类",
            "国家专项",
            "中俄合作办学",
            "地方专项",
            "民族预科"
        ]
    },
    {
        "黑龙江_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "黑龙江_2017_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "上海_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "上海_2019_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "上海_2018_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "上海_2017_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江苏_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "浙江_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "浙江_2019_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "浙江_2018_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "浙江_2017_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "安徽_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "安徽_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "安徽_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "安徽_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "安徽_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "安徽_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "安徽_2017_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "福建_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "福建_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "江西_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2020_综合改革_sex_campus": [
            "普通类",
            "艺术批",
            "中美121项目"
        ]
    },
    {
        "山东_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2019_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山东_2019_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山东_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2018_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山东_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "山东_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "山东_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2020_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2020_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2019_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2019_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2018_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "河南_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "河南_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖北_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2020_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2020_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2020_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2019_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2019_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2019_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2018_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2018_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "湖南_2017_艺术(理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "湖南_2017_艺术(不分文理)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "广东_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广东_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "广西_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2020_综合改革_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "海南_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "重庆_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "重庆_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "四川_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "四川_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "贵州_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "云南_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "云南_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "陕西_2020_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2019_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2018_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2018_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "陕西_2017_理工_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "陕西_2017_艺术(文)_sex_campus": [
            "艺术批"
        ]
    },
    {
        "甘肃_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2020_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2019_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2018_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "甘肃_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "青海_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "青海_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "青海_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "青海_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "青海_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "青海_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "青海_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "青海_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "宁夏_2020_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "宁夏_2020_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "宁夏_2019_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "宁夏_2019_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "宁夏_2018_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "宁夏_2018_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "宁夏_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "宁夏_2017_文史_sex_campus": [
            "普通类"
        ]
    },
    {
        "新疆_2020_理工_sex_campus": [
            "普通类",
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2020_文史_sex_campus": [
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2019_理工_sex_campus": [
            "普通类",
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2019_文史_sex_campus": [
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2018_理工_sex_campus": [
            "普通类",
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2018_文史_sex_campus": [
            "国家专项",
            "阿勒泰定向"
        ]
    },
    {
        "新疆_2017_理工_sex_campus": [
            "普通类",
            "国家专项"
        ]
    },
    {
        "新疆_2017_文史_sex_campus": [
            "普通类",
            "国家专项"
        ]
    }
]


def main():
    headers = {
        "Accept": "*/*",
        "Accept-Encoding": "gzip, deflate",
        "Accept-Language": "zh-CN,zh;q=0.9,en;q=0.8",
        "Connection": "keep-alive",
        # "Content-Length": "99",
        "Content-Type": "application/x-www-form-urlencoded; charset=UTF-8",
        "Cookie": "zhaosheng.neau.session.id=be6fea6da6d947ea968a0aa03c8d00d3",
        "Csrf-Token": "be0636139ba9417090ba64f790c15d44",
        "Host": "zsb.neau.edu.cn",
        "Origin": "http://zsb.neau.edu.cn",
        "Referer": "http://zsb.neau.edu.cn/static/front/neau/basic/html_web/lnfs.html",
        "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36",
        # "X-Requested-Time": "1626769557685",
        "X-Requested-With": "XMLHttpRequest"
    }
    url = 'http://zsb.neau.edu.cn/f/ajax_lnfs?ts={}'
    param_point = 0
    bfg = False
    csrf_token = ['be0636139ba9417090ba64f790c15d44',
                  '91d64c393b4d4229b44251afc453dd5e',
                  'c0bca9bdae9742ffbf691ffc06fb758d']
    try:
        for obj in query_params:
            for key, value in obj.items():
                op = key.split('_')[:-2]
                for tp in value:
                    ts = int(time.time() * 1000)
                    data = f"ssmc={op[0]}&zsnf={op[1]}&klmc={op[2]}&zslx={tp}"
                    url = url.format(ts)
                    print(data, url)
                    headers['X-Requested-Time'] = str(ts)
                    headers['Csrf-Token'] = csrf_token.pop()
                    res = requests.post(url=url, headers=headers, data=data.encode())
                    csrf_token.append(res.headers['Csrf-Token'])
                    dd = res.json()
                    bb = json.dumps(dd, ensure_ascii=False)
                    print(dd)
                    if dd.get('state') == 1:
                        with open(f"东北农业大学/{data}", 'wb') as f:
                            f.write(bb.encode())
                    else:
                        bfg = True
                        break
                if bfg:
                    break
            if bfg:
                break
    except Exception as e:
        print(f'错误记录点： {param_point}')
        print(str(e))


if __name__ == '__main__':
    main()
    # print(int(time.time() * 1000))
