import requests

mylist = [
    {
        "北京_2020_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "北京_2019_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "北京_2018_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "天津_2020_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "天津_2019_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "天津_2019_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "天津_2018_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "天津_2018_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "河北_2020_理工_sex_campus": [
            "本部普通批",
            "国家专项"
        ]
    },
    {
        "河北_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "河北_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "河北_2019_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "河北_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "山西_2020_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "山西_2019_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "山西_2018_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "内蒙古_2020_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "内蒙古_2020_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "内蒙古_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "内蒙古_2019_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "内蒙古_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "内蒙古_2018_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "辽宁_2020_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "辽宁_2020_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "辽宁_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "辽宁_2019_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "辽宁_2019_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "辽宁_2019_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "辽宁_2018_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "辽宁_2018_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "吉林_2020_理工_sex_campus": [
            "本部一批",
            "本部二批",
            "加试蒙古语文"
        ]
    },
    {
        "吉林_2020_文史_sex_campus": [
            "本部二批"
        ]
    },
    {
        "吉林_2019_理工_sex_campus": [
            "本部一批",
            "本部二批",
            "加试蒙古语文"
        ]
    },
    {
        "吉林_2019_文史_sex_campus": [
            "本部二批"
        ]
    },
    {
        "吉林_2018_理工_sex_campus": [
            "本部一批",
            "本部二批",
            "地方专项"
        ]
    },
    {
        "吉林_2018_文史_sex_campus": [
            "本部二批"
        ]
    },
    {
        "黑龙江_2020_理工_sex_campus": [
            "本部一批",
            "本部软件",
            "荣成普通类",
            "荣成软件",
            "国家专项",
            "地方专项"
        ]
    },
    {
        "黑龙江_2020_文史_sex_campus": [
            "本部一批",
            "荣成普通类"
        ]
    },
    {
        "黑龙江_2020_艺术(理)_sex_campus": [
            "本部艺术",
            "荣成艺术"
        ]
    },
    {
        "黑龙江_2020_艺术(文)_sex_campus": [
            "本部艺术",
            "荣成艺术"
        ]
    },
    {
        "黑龙江_2019_理工_sex_campus": [
            "本部一批",
            "本部二批",
            "本部软件",
            "荣成普通类",
            "荣成软件",
            "国家专项",
            "地方专项"
        ]
    },
    {
        "黑龙江_2019_文史_sex_campus": [
            "本部二批",
            "荣成普通类"
        ]
    },
    {
        "黑龙江_2019_艺术(理)_sex_campus": [
            "本部艺术",
            "荣成艺术"
        ]
    },
    {
        "黑龙江_2019_艺术(文)_sex_campus": [
            "本部艺术",
            "荣成艺术"
        ]
    },
    {
        "黑龙江_2018_理工_sex_campus": [
            "本部一批",
            "本部二批",
            "本部软件",
            "荣成普通类",
            "荣成软件",
            "国家专项",
            "地方专项"
        ]
    },
    {
        "黑龙江_2018_文史_sex_campus": [
            "本部二批",
            "荣成普通类"
        ]
    },
    {
        "上海_2020_综合改革_sex_campus": [
            "本部普通批",
            "本部艺术"
        ]
    },
    {
        "上海_2019_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "上海_2018_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "江苏_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "江苏_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "江苏_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "江苏_2019_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "江苏_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "浙江_2020_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "浙江_2019_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "浙江_2018_综合改革_sex_campus": [
            "本部一批"
        ]
    },
    {
        "安徽_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "安徽_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "安徽_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "安徽_2019_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "安徽_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "福建_2020_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "福建_2019_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "福建_2018_理工_sex_campus": [
            "本部二批"
        ]
    },
    {
        "江西_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "江西_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "江西_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "山东_2020_综合改革_sex_campus": [
            "本部普通批",
            "荣成普通类",
            "荣成艺术"
        ]
    },
    {
        "山东_2019_理工_sex_campus": [
            "本部普通批",
            "荣成普通类"
        ]
    },
    {
        "山东_2019_文史_sex_campus": [
            "荣成普通类"
        ]
    },
    {
        "山东_2019_艺术(文)_sex_campus": [
            "荣成艺术"
        ]
    },
    {
        "山东_2018_理工_sex_campus": [
            "本部普通批",
            "荣成普通类"
        ]
    },
    {
        "山东_2018_文史_sex_campus": [
            "本部普通批",
            "荣成普通类"
        ]
    },
    {
        "河南_2020_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "河南_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "河南_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "湖北_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "湖北_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "湖北_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "湖南_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "湖南_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "湖南_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "广东_2020_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "广东_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "广东_2019_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "广东_2019_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "广东_2018_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "广西_2020_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "广西_2019_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "广西_2018_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "海南_2020_综合改革_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "海南_2019_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "海南_2019_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "海南_2018_理工_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "海南_2018_文史_sex_campus": [
            "本部普通批"
        ]
    },
    {
        "重庆_2020_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "重庆_2020_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "重庆_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "重庆_2019_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "重庆_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "重庆_2018_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2020_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2019_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "四川_2018_文史_sex_campus": [
            "本部一批"
        ]
    },
    {
        "贵州_2020_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "贵州_2019_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "贵州_2018_理工_sex_campus": [
            "本部一批",
            "本部二批"
        ]
    },
    {
        "云南_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "云南_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "云南_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "西藏_2020_理工_sex_campus": [
            "本部一批",
            "内地西藏班"
        ]
    },
    {
        "西藏_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "西藏_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "陕西_2020_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "陕西_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "陕西_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "甘肃_2020_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "甘肃_2019_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "甘肃_2018_理工_sex_campus": [
            "本部一批",
            "国家专项"
        ]
    },
    {
        "青海_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "青海_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "青海_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "宁夏_2020_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "宁夏_2019_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "宁夏_2018_理工_sex_campus": [
            "本部一批"
        ]
    },
    {
        "新疆_2020_理工_sex_campus": [
            "南疆单列对口援疆",
            "内地新疆班"
        ]
    },
    {
        "新疆_2020_文史_sex_campus": [
            "南疆单列对口援疆",
            "内地新疆班"
        ]
    },
    {
        "新疆_2020_艺术_sex_campus": [
            "本部艺术"
        ]
    },
    {
        "新疆_2019_理工_sex_campus": [
            "南疆单列对口援疆",
            "内地新疆班"
        ]
    },
    {
        "新疆_2019_文史_sex_campus": [
            "南疆单列对口援疆",
            "内地新疆班"
        ]
    },
    {
        "新疆_2018_理工_sex_campus": [
            "本部二批"
        ]
    }
]

param = {
    'ssmc': '黑龙江',
    'zsnf': '2020',
    'klmc': '理工',
    'zslx': '荣成软件'
}

url = ''